{
  "projects": [
    {
      "id": "eos",
      "languages": [
        "Angular",
        "CSS",
        "CSS Animation",
        "HTML",
        "Typescript"
      ],
      "name": "EOSBet",
      "projectImage": "eos-page.png",
      "projectAlt": "EOSBet page",
      "year": 2019,
      "image": "eosbet.jpg",
      "alt": "Click to see EOSBet work",
      "intro": "",
      "description": "",
      "wrapup": "",
      "url": "https://eosbet.io"
    },
    {
      "id": "scream",
      "languages": [
        "React",
        "Bootstrap"
      ],
      "name": "Scream at Trump",
      "projectImage": "scream.png",
      "projectAlt": "Scream at Trump page",
      "year": 2019,
      "image": "sat.png",
      "alt": "Click to see Scream at Trump work",
      "intro": "",
      "description": "",
      "wrapup": "",
      "url": "https://www.screamattrump.com/"
    },
    {
    "id": "cisco",
    "languages": [
      "Angular 8",
      "Typescript",
      "Bootstrap",
      "Highcharts",
      "rxjs",
      "json"
    ],
    "name": "Cisco",
    "projectImage": "cisoc_one.jpg",
    "projectAlt": "Cisco logo", 
    "year": 2019,
    "image": "cisco.jpg",
    "alt": "Click to see Cisco work",
    "intro": "When I started my job at Smashing Boxes, I joined the Cisco UI team. This is an integrated team of contractors and full time Cisco employees, who all work on building Angular applications. I had a little bit of experience with React and Vue through The Iron Yard, my last job, and personal projects, but nothing in Angular. I was excited to get the opportunity to really focus on a specific framework.",
    "description": "When I started learning and working on the application, there were so many new topics to learn about. In addition to Angular, I was introduced to TypeScript and a little bit of rxjs. I immediately loved TypeScript, and felt that having type definition made learning it and Angular so much easier. Unfortunately, we were working with some unreliable APIs, so making interfaces for expected data responses became pretty important and valuable as well. Towards the end, my team and I often found ourselves writing our own mock APIs. ",
    "wrapup": "End though the app didn't launch (through reasons out of our control), I learned a ton of valuable skills. I'm excited to use them in the next Cisco application, and continue to learn more about Angular and TypeScript!"
  },
  {
    "id": "duke",
    "languages": [
      "Drupal",
      "html",
      "css",
      "javascript"
    ],
    "name": "Duke Chapel",
    "projectImage": "dc-page.png",
    "projectAlt": "Duke Chapel logo",
    "year": 2019,
    "image": "dc.jpeg",
    "alt": "Click to see Duke Chapel work",
    "intro": "",
    "description": "",
    "wrapup": "",
    "url": "https://chapel.duke.edu/"
  },
  {
    "id": "keyframes",
    "languages": [
      "css",
      "css animation",
      "html"
    ],
    "name": "Intro to CSS Transitions, Transforms and Keyframes",
    "projectImage": "keyframes_one.jpg",
    "projectAlt": "Slide from keyframes class: Transition Timing Function Determines the in-between steps of the transition Example: Does the animation start off slow and get faster? Default value is ease",
    "year": 2018,
    "image": "keyframes.jpg",
    "alt": "intro to CSS transitions, transforms and keyframes hannah hudson",
    "intro": "I created this lesson for a CSS crash course. I chose to focus on animation, because its something fun and a little bit different than your average \"Intro to CSS\" course. I had about 10 people in attendance for this Meetup, and it led me to teach another CSS and animation crash course centered around coding holiday cards.",
    "description": "This class followed the slides and focused on terms, but my holiday card course was more of an interative code-along. I had two levels of cards to show the class, since I didn't quite know how much coding experience my students would have.",
    "wrapup": "Overall, the class went reallt well! My students were amazed and excited at how much animation is possible with CSS alone. In future, I'd love to teach this class in two parts or for two hours to be better able to explain the key properties of animation and transition.",
    "url": "https://hannahhch.github.io/keyframes-crash-course/slides/slides.html#slide-0"
  },
  {
    "id": "first-bank",
    "languages": [
      "Wordpress",
      "Vue",
      "jQuery",
      "Bootstrap",
      "php",
      "twig"
    ],
    "projectImage": "fb_one.jpg",
    "projectAlt": "Screenshot of First Bank rewards calculator",
    "name": "First Bank",
    "year": 2018,
    "image": "fb.jpg",
    "alt": "Click to see work on First Bank",
    "url": "https://localfirstbank.com/"
  }, {
    "id": "hill-center",
    "languages": [
      "Wordpress",
      "php",
      "jQuery",
      "scss",
      "Google analytics"
    ],
    "projectImage": "hc_one.jpg",
    "projectAlt": "Screenshot of Hillcenter video tour page",
    "name": "Hill Center",
    "year": 2018,
    "image": "hc.jpg",
    "alt": "Click to see work on Hill Center",
    "url": "https://www.hillcenter.org/"
  }, {
    "id": "rourk",
    "languages": [
      "css animation",
      "jQuery",
      "Wordpress",
      "php",
      "scss",
      "google analytics"
    ],
    "projectImage": "rourk_one.jpg",
    "projectAlt": "Screenshot of Rourk homepage",
    "name": "Rourk",
    "year": 2018,
    "image": "rourk.png",
    "alt": "Click to see work on Rourk",
    "url": "https://rourkcapital.com/"
  }, {
    "id": "fbomb",
    "languages": [
      "shopify",
      "scss",
      "jQuery",
      "twig"
    ],
    "projectImage": "fbomb_one.jpg",
    "projectAlt": "Screenshot of fbomb category section",
    "name": "fbomb",
    "year": 2018,
    "image": "fbomb.jpg",
    "alt": "Click to see work on f bomb",
    "url": "https://www.dropanfbomb.com/"
  }, {
    "id": "e-conolight",
    "languages": [
      "HTML",
      "SCSS",
      "Magento 2",
      "jQuery"
    ],
    "projectImage": "econo_one.jpg",
    "projectAlt": "Screenshot of econolight poles page",
    "name": "e-conolight",
    "year": 2017,
    "image": "econo.jpg",
    "alt": "Click to see work on e conolight",
    "url": "https://www.e-conolight.com/",
    "intro": "E-conoglight is a brand under Cree - an international company that creates and sells lighting, electrical supplies and more. When I started at Rivers Agency, the new e-conolight e-commerce site was underway. This was the first project I worked on at Rivers Agency."

  }, {
    "id": "tourify",
    "languages": [
      "React",
      "Rails API",
      "Google Maps"
    ],
    "projectImage": "tourify_one.jpg",
    "projectAlt": "Screenshot of tourify homepage",
    "name": "Tourify",
    "year": 2017,
    "image": "tiy.png",
    "alt": "Click to see work on Tourify",
    "url": "https://serene-brushlands-14696.herokuapp.com/",
    "gitHub": "https://github.com/Tourify/tourify",
    "intro": "Tourify is a web application designed to guide users on a historic tour of downtown Durham, NC. I worked on Tourify for my final project at The Iron Yard (coding bootcamp). While not a native app, my team and I built Tourify with mobile designs in mind. We saw users looking at their phones to guide them to different tour stops as shown on the app. At The Iron Yard, there were about 5 final project teams, and I was initially on a different one. Unfortunately, one of my team members would not be participating in final projects, so the decision was made to split up the remaining members into existing groups. I missed the first 2 planning days of tourify, and the team was already made up of 2 frontend and 2 backend developers. I was a little worried that roles were already assigned, and that there wasn't anything I could focus on. Luckily, all of my new team members were welcoming and glad that I joined the team.",
    "description": "We only had 2 weeks to create the app, and they really wanted someone to figure out how to add actual maps and geolocation to the app. It was something we had never done (especially within a React app). The alternative was to use screenshots of locations, so I volunteered to dive into the Google Maps API. Figuring out Google Maps was a fun challenge. I found so many tutorials for using the API, but it was a whole different issue making it work with React. I was overjoyed when I figured out how to embedded the different maps, that I went for geolocation too! It was really cool having that feature, so that a user could see about how far away they were from a tour stop. ",
    "wrapup": "Working on Tourify was my first taste at working on a real dev team, and I was ready for it! I throughly enjoyed all of the individual projects at The Iron Yard, but I was ready to see what it would be like at a real dev job. With my background as a high school special education teacher, this was all new to me. Overall, I'm happy with how the final project went, both working with others on a team, learning new skills and even presenting the final creation on demo day. It was a little nervewracking, but great to speak about my part in the project, and chat with employeers about it afterwards. I can even credit getting my first developer job to Tourify!"
  }]
}
